app/Views/partials/topbar.php

                        <?php
                        $programModel = new \App\Models\ProgramModel();
                        $currentProgramId = session('current_program');
                        $currentProgram = $programModel->find($currentProgramId);
                        $allPrograms = $programModel->findAll();
---
SELECT *
FROM `programs`
WHERE `programs`.`id` = '5'
SELECT *
FROM `programs`