app/Controllers/Dashboard.php

    public function __construct()
    {
        $this->dashboardModel = new \App\Models\DashboardModel();
        $this->programModel = new \App\Models\ProgramModel();
        $this->programCategoryModel = new \App\Models\ProgramCategoryModel();
        $this->adminModel = new \App\Models\AdminModel();
    }    public function index()
    {
        $programId = session('current_program');

        // If no program is selected, redirect to welcome page
        if (!$programId) {
            return redirect()->to('welcome')->with('error', 'Please select a program to continue.');
        }

        $program = $this->programModel->find($programId);
---
SELECT *
FROM `programs`
WHERE `programs`.`id` = '3'