app/Controllers/Payments.php

SELECT *
FROM `programs`
WHERE `programs`.`id` = '5'
---
    public function index()
    {
        $programId = session('current_program');
        $program = $this->programModel->find($programId);

SELECT *
FROM `programs`
WHERE `programs`.`id` = '3'
---
    public function view($id)
    {
        $payment = $this->paymentModel->getPaymentById($id);

        // Check if payment exists and belongs to the current program
        if (!$payment || $payment->program_id != session('current_program')) {
            return redirect()->to('payments')->with('error', 'Payment not found');
        }

        $data = [
            'payment' => $payment,  'payment' => $payment,
            'program' => $this->programModel->find(session('current_program'))