app/Models/AdminModel.php

SELECT *
FROM `admins`
WHERE `email` = 'ival@gmail.com'
 LIMIT 1
---
    public function getAdminByEmail($email)
    {
        return $this->where('email', $email)->first();