app/Models/PaymentModel.php

    public function getPaymentById($id)
    {
        return $this->select('
                payments.*,
                participants.full_name as participant_name,
                users.email as participant_email,
                participants.program_id
            ')
            ->join('participants', 'participants.id = payments.participant_id')
            ->join('users', 'users.id = participants.user_id')
            ->where('payments.id', $id)
            ->first();
---
SELECT `payments`.*, `participants`.`full_name` as `participant_name`, `users`.`email` as `participant_email`, `participants`.`program_id`
FROM `payments`
JOIN `participants` ON `participants`.`id` = `payments`.`participant_id`
JOIN `users` ON `users`.`id` = `participants`.`user_id`
WHERE `payments`.`id` = '4414'
 LIMIT 1