app/Models/ProgramCategoryModel.php

SELECT `pc`.*, `pt`.`name` as `program_type_name`
FROM `program_categories` `pc`
LEFT JOIN `program_types` `pt` ON `pt`.`id` = `pc`.`program_type_id`
SELECT *
FROM `programs`
WHERE `program_category_id` = '1'
---
    public function getAllCategoriesWithPrograms() {
        $builder = $this->builder('program_categories pc');
        $builder->select('pc.*, pt.name as program_type_name')
            ->join('program_types pt', 'pt.id = pc.program_type_id', 'left');
            // ->where('pc.is_deleted', 0)
            // ->where('pc.is_active', 1);

        $categories = $builder->get()->getResult();

        $programModel = new \App\Models\ProgramModel();

        foreach ($categories as &$category) {
            // Get all programs for this category
            $programs = $programModel->where('program_category_id', $category->id)